[Killed] BlockStatement
commentController.js:15:36
     return Number.isInteger(score) && score >= 1 && score <= 10;
   }
   
-  function submitComment(req, res) {
-    const { text, securityRating } = req.body;
-  
-    if (!isValidComment(text)) {
-      return res.status(400).json({ message: "Invalid comment text" });
-    }
-  
-    if (!isValidSecurityRating(securityRating)) {
-      return res.status(400).json({ message: "Invalid security rating" });
-    }
-  
-    // Save comment (mock)
-    const savedComment = { text, securityRating };
-    return res.status(201).json({ message: "Comment saved", data: savedComment });
-  }
+  function submitComment(req, res) {}
   
   module.exports = { submitComment, isValidComment, isValidSecurityRating };
killedBy: submitComment saves valid comment
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 201

Number of calls: 0

[Killed] StringLiteral
commentController.js:28:44
   
     // Save comment (mock)
     const savedComment = { text, securityRating };
-    return res.status(201).json({ message: "Comment saved", data: savedComment });
+    return res.status(201).json({ message: "", data: savedComment });
   }
   
killedBy: submitComment saves valid comment
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "data": Object {
      "securityRating": 5,

[Killed] ObjectLiteral
commentController.js:31:20
     return res.status(201).json({ message: "Comment saved", data: savedComment });
   }
   
-  module.exports = { submitComment, isValidComment, isValidSecurityRating };
+  module.exports = {};
   
killedBy: isValidComment valid comment
statusReason: TypeError: isValidComment is not a function
