[Killed] BlockStatement
commentController.js:1:31
-function isValidComment(text) {
-    const forbiddenChars = /["';.()%]/;
-    return (
-      typeof text === "string" &&
-      text.length >= 3 &&
-      text.length <= 300 &&
-      !forbiddenChars.test(text)
-    );
-  }
+function isValidComment(text) {}
   
   function isValidSecurityRating(score) {
killedBy: isValidComment valid comment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] EqualityOperator
commentController.js:4:7
 function isValidComment(text) {
     const forbiddenChars = /["';.()%]/;
     return (
-      typeof text === "string" &&
+      typeof text !== "string" &&
       text.length >= 3 &&
       text.length <= 300 &&
killedBy: isValidComment valid comment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
commentController.js:4:7
 function isValidComment(text) {
     const forbiddenChars = /["';.()%]/;
     return (
-      typeof text === "string" &&
-      text.length >= 3 &&
+      typeof text === "string" || text.length >= 3 &&
       text.length <= 300 &&
       !forbiddenChars.test(text)
killedBy: isValidComment too short
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
commentController.js:5:7
     const forbiddenChars = /["';.()%]/;
     return (
       typeof text === "string" &&
-      text.length >= 3 &&
+      text.length < 3 &&
       text.length <= 300 &&
       !forbiddenChars.test(text)
killedBy: isValidComment valid comment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
commentController.js:5:7
     const forbiddenChars = /["';.()%]/;
     return (
       typeof text === "string" &&
-      text.length >= 3 &&
+      true &&
       text.length <= 300 &&
       !forbiddenChars.test(text)
killedBy: isValidComment too short
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
commentController.js:6:7
     return (
       typeof text === "string" &&
       text.length >= 3 &&
-      text.length <= 300 &&
+      text.length < 300 &&
       !forbiddenChars.test(text)
     );
killedBy: valid comment exactly 300 characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
commentController.js:6:7
     return (
       typeof text === "string" &&
       text.length >= 3 &&
-      text.length <= 300 &&
+      text.length > 300 &&
       !forbiddenChars.test(text)
     );
killedBy: isValidComment valid comment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
commentController.js:7:7
       typeof text === "string" &&
       text.length >= 3 &&
       text.length <= 300 &&
-      !forbiddenChars.test(text)
+      forbiddenChars.test(text)
     );
   }
killedBy: isValidComment valid comment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
commentController.js:11:41
     );
   }
   
-  function isValidSecurityRating(score) {
-    return Number.isInteger(score) && score >= 1 && score <= 10;
-  }
+  function isValidSecurityRating(score) {}
   
   function submitComment(req, res) {
killedBy: isValidSecurityRating valid integer in range
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] EqualityOperator
commentController.js:12:53
   }
   
   function isValidSecurityRating(score) {
-    return Number.isInteger(score) && score >= 1 && score <= 10;
+    return Number.isInteger(score) && score >= 1 && score < 10;
   }
   
killedBy: isValidSecurityRating valid integer in range
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
commentController.js:12:12
   }
   
   function isValidSecurityRating(score) {
-    return Number.isInteger(score) && score >= 1 && score <= 10;
+    return false;
   }
   
killedBy: isValidSecurityRating valid integer in range
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
commentController.js:15:36
     return Number.isInteger(score) && score >= 1 && score <= 10;
   }
   
-  function submitComment(req, res) {
-    const { text, securityRating } = req.body;
-  
-    if (!isValidComment(text)) {
-      return res.status(400).json({ message: "Invalid comment text" });
-    }
-  
-    if (!isValidSecurityRating(securityRating)) {
-      return res.status(400).json({ message: "Invalid security rating" });
-    }
-  
-    const savedComment = { text, securityRating };
-    return res.status(201).json({ message: "Comment saved", data: savedComment });
-  }
+  function submitComment(req, res) {}
   
   module.exports = { submitComment, isValidComment, isValidSecurityRating };
killedBy: submitComment saves valid comment
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 201

Number of calls: 0

[Killed] BooleanLiteral
commentController.js:18:9
   function submitComment(req, res) {
     const { text, securityRating } = req.body;
   
-    if (!isValidComment(text)) {
+    if (isValidComment(text)) {
       return res.status(400).json({ message: "Invalid comment text" });
     }
killedBy: submitComment saves valid comment
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 201
Received: 400

Number of calls: 1

[Killed] ConditionalExpression
commentController.js:18:9
   function submitComment(req, res) {
     const { text, securityRating } = req.body;
   
-    if (!isValidComment(text)) {
+    if (false) {
       return res.status(400).json({ message: "Invalid comment text" });
     }
killedBy: submitComment rejects invalid comment
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 201

Number of calls: 1

[Killed] BooleanLiteral
commentController.js:22:9
       return res.status(400).json({ message: "Invalid comment text" });
     }
   
-    if (!isValidSecurityRating(securityRating)) {
+    if (isValidSecurityRating(securityRating)) {
       return res.status(400).json({ message: "Invalid security rating" });
     }
killedBy: submitComment saves valid comment
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 201
Received: 400

Number of calls: 1

[Killed] BlockStatement
commentController.js:22:49
       return res.status(400).json({ message: "Invalid comment text" });
     }
   
-    if (!isValidSecurityRating(securityRating)) {
-      return res.status(400).json({ message: "Invalid security rating" });
-    }
+    if (!isValidSecurityRating(securityRating)) {}
   
     const savedComment = { text, securityRating };
killedBy: submitComment rejects invalid rating
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 201

Number of calls: 1

[Killed] ObjectLiteral
commentController.js:23:35
     }
   
     if (!isValidSecurityRating(securityRating)) {
-      return res.status(400).json({ message: "Invalid security rating" });
+      return res.status(400).json({});
     }
   
killedBy: submitComment rejects invalid rating
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "Invalid security rating",
- }
